In [24]:
import numpy as np

In [25]:
import pandas as pd

In [6]:
#Task-1
nos = np.arange(10)
sum_nos = 0
for i in nos:
    sum_nos = sum_nos + i
    print("Number =",str(i),"\t","Cumulative sum =",str(sum_nos))

Number = 0 	 Cumulative sum = 0
Number = 1 	 Cumulative sum = 1
Number = 2 	 Cumulative sum = 3
Number = 3 	 Cumulative sum = 6
Number = 4 	 Cumulative sum = 10
Number = 5 	 Cumulative sum = 15
Number = 6 	 Cumulative sum = 21
Number = 7 	 Cumulative sum = 28
Number = 8 	 Cumulative sum = 36
Number = 9 	 Cumulative sum = 45

In [5]:
#Task-2
char_ls = ['A','B','C','D','E']
for i in range(len(char_ls)):
    print((char_ls[i]+"\t")*(i+1))

A
B	B
C	C	C
D	D	D	D
E	E	E	E	E

In [58]:
#Task-3
contact_dict = {"Name":["person1","person2"],"age":[23,34],"height":[5.8,6.1],"Address":["address1","address2"],"cell number":[1234567890,9876543210]}
df_t3 = pd.DataFrame(contact_dict)
print(df_t3)

      Name  age  height   Address  cell number
0  person1   23     5.8  address1   1234567890
1  person2   34     6.1  address2   9876543210

In [16]:
#Task-4
num_t4 = int(input("Enter number : ")) #Enter number 2345667
for i in str(num_t4):
    print(i)

Enter number : 2345667
2
3
4
5
6
6
7

In [20]:
#Task-5
letters = ["a","b","c","d"]
letters.insert(0,"z")
print(letters)

['z', 'a', 'b', 'c', 'd']

In [27]:
# Task-6
nos_t6 = np.arange(10)
print(nos_t6[ nos_t6 % 2 != 0])

[1 3 5 7 9]

In [29]:
# Task-7
stringname = "Hello, All!"
for i in stringname:
    print(i)

H
e
l
l
o
,

A
l
l
!

In [30]:
# Task-8
Input_list = [2,4,6,8,10,13,12,14,16,18]
for i in Input_list:
    if i%2 != 0:
        break
    else:
        print(i)

2
4
6
8
10

In [40]:
# Task-9
my_list1 = [1,3,5,7]
my_list2 = [2,4,6,8]
for i in range(len(my_list1)):
    print(my_list1[i],my_list2[i])

1 2
3 4
5 6
7 8

In [41]:
# Task-10
def product(num1,num2):
    print(num1*num2)
    
product(2,3)

6

In [48]:
# Task-11
def fibonacci_series(num):
    first_num = 0
    second_num = 1
    for i in range(num):
        if  i==0:
            print(first_num,end=",")
        elif i==1:
            print(second_num,end=",")
        else:
            sum=first_num + second_num
            print(sum,end=",")
            first_num = second_num
            second_num = sum

fibonacci_series(8)

0,1,1,2,3,5,8,13,

In [53]:
# Task-12
sample_data = pd.read_csv("train.csv") #imported a file "train.csv"
sample_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [57]:
# Task-13
def remove_duplicates(lis):
    create_set = set(lis)
    return list(create_set)
    
lis_t13 = [1,2,2,5,6,6,4,5]
print(remove_duplicates(lis_t13))

[1, 2, 4, 5, 6]

In [67]:
# Task-14
df_t14 = pd.read_json("task_14.json")
df_t14.head()

      name shirt_color laptops  has_a_dog items_on_desk
0  Michele        blue  yellow      False           mug
1  Michele        blue  yellow      False           pen
2  Michele        blue  yellow      False       monitor

In [76]:
# Task-15
def remove_duplicates_intersection(lis1,lis2):
    set1 = set(lis1)
    set2 = set(lis2)
    return(list(set1.intersection(set2)))
lis1 = [1,1,2,3,5,8,13,21,34,55,89]
lis2 = [1,2,3,4,5,6,7,8,9,10,11,12,13]
print(remove_duplicates_intersection(lis1,lis2))

[1, 2, 3, 5, 8, 13]

In [51]:
# Task-16
def reverse_string(string):
    ls = string.split(" ")
    for i in range(len(ls)):
        print(ls[-(i+1)],end=" ")
            
str_t16 = "My name is Mike"
reverse_string(str_t16)

Mike is name My

In [3]:
# Task-17
def first_last_num(lis):
    return [lis[0],lis[-1]]

lis_t17 = [10,20,30,40,50,60]
print(first_last_num(lis_t17))

[10, 60]

In [22]:
# Task-18
def verify_prime(num):
    flag=0
    for i in range(2,(num//2)+1):
        if num%i == 0:
            flag+=1
    if flag>0:
        print("{} is composite".format(num))
    else:
        print("{} is prime".format(num))

num_t18 = int(input("Enter a number : "))#Enter a number to check for prime or composite
verify_prime(num_t18)

Enter a number : 56
56 is composite

In [67]:
# Task-19
def search_number(ls,num):
    mid = len(ls)//2
    if num > ls[-1] or num < ls[0]:
        return False
    elif num == ls[mid]:
        return True
    else:
        if num > ls[mid]:
            return search_number(ls[mid+1:],num)
        else:
            return search_number(ls[:mid],num)
    
ls_t19 = np.arange(26)
print(search_number(ls_t19,3))

True

In [ ]:
# Task-20

In [68]:
from bs4 import BeautifulSoup
import requests

In [135]:
url = "https://www.nytimes.com"
header = {'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.135 Safari/537.36 Edge/12.246'}
html = requests.get(url, headers = header).content
soup = BeautifulSoup(html, "lxml")

for i in soup.select(".story-wrapper"):
    try:
        print(i.find('h3').get_text())
    except:
        print("")

Haitian Officials Say American Held in Assassination Was Seeking Power
The Mystery Deepens: What Were Colombian Military Vets Doing in Haiti?
The Rationing of a Last-Resort Covid Treatment
Despite Outbreaks Among Unvaccinated, Fox News Hosts Smear Shots
Migrant workers in South Asia have lost jobs amid slow immunizations and red tape. Here’s the latest on Covid-19.
U.S. vaccinations ›
E.P.A. Approved Toxic Chemicals for Fracking a Decade Ago, New Files Show
More power lines or rooftop solar panels? The debate is on over the future of energy.
As Republicans Take Aim at Voting, Democrats Search for a Response
Florida, the Land of Gleaming Condos, Frets After Collapse

Facebook Wants to Court Creators. It Could Be a Tough Sell.
Silicon Valley investors are increasingly seeing influencers as the next goldmine on the internet.
Bank profits are poised to surge as the pandemic recedes. Here’s the latest on business.
Cubans Denounce ‘Misery’ in Biggest Protests in Decades
Hong Kong Migrants Seek Fresh Start in U.K. After Crackdown

Why Jane Goodall Still Has Hope for Us Humans
Karen Petrou
Gail Collins and Bret Stephens
Roxanne Khamsi
Margaret Renkl
Musa Okwonga
Brent Staples
Charles M. Blow
Maureen Dowd
Ross Douthat
Adam Grant
Amy Wilentz
Viet Thanh Nguyen
Tracy Kennard
Michael Pollan
Tourists in N.Y.C. Marvel at a Cleaner, Less-Crowded Subway
Andrew Lloyd Webber’s New Act: Activism
How Do You Stop Those Relentless Robocalls?